docs/style.org
#+TITLE:    Org-mode 翻訳スタイルガイド
#+AUTHOR:   Takaaki ISHIKAWA
#+EMAIL:    takaxp@ieee.org
#+LANGUAGE: ja
#+STARTUP:  content
#+TEXT:     このスタイルガイドに沿って翻訳作業を進めます．
#+setupfile: theme-readtheorg.setup
#+READONLY
#
* 文体
  - 原則として，「です／ます調」に統一する．

	ただし，箇条書きの中やコマンドの説明など，場合によっては「である調」を
	用いても良い．

* 英単語のカタカナ表記
  - 原則として「長音」を使う

	ただし，慣用表現の場合は例外とする．

* カタカナ表記における「・」
  - 原則として「・」を入れない．
	オンライン・ショッピング => オンラインショッピング

	ただし，人名は例外とする．

* 文頭意外の大文字
  - 原則として原語をそのまま利用する．

	Emacs，Lisp，など．

* 算用数字と漢数字
  - 算用数字は，半角小文字で表記する．
  - 数を表す場合は，算用数字を用いる．（10人，70個）
  - 意味を表す場合は，漢数字を用いる．（一度の，二重の）

* 句読点
  - 「､。」に統一する．

	PDFなどへの文書変換時に自動置換するため，厳守ではない．

* 単数形と複数形
  - 単数形と複数形でも訳が変わらず，カタカナ訳をそのまま用いる場合は最後の's'は訳に含めない

@<pre>
	（○）archive  => アーカイブ
	（○）archives => アーカイブ
	（×）archives => アーカイブス
@</pre>

* 英数字の前後
  - 半角スペースを含めない．

	 => PO から texi に変換する技術的な問題から，含めない．
	（外観は，翻訳作業終了後にバッチ処理で修正可能）

  - 同様の理由から，翻訳文には半角スペースを入れないこと．
	改行が必要な場合は，
@<pre>
	これは一行目です。\n
	これは二行目です。
@</pre>
	というように，改行コード（\n）を入れる．

* 強調する場合
  - クォーテーション（「"」「'」）は用いず，「」でくくる．	

* Texinfo コマンドについて
  - コマンドの書き写しミスに気を付ける．
  - 括弧の対応関係（閉じ忘れなど）に気を付ける．
  - node は翻訳せずに，英文をそのまま書き写す．
  - エスケープシーケンス（\, バックスラッシュ）の重複に気を付ける．
  - @pxref{hoge} は，(@pxref{hoge}) というように中括弧に含まれているのがルール
  - @xref{hoge} は，@xref{hoge}. のように半角ピリオドで終わるのがルール
  - 次のコマンドの中身は訳しても問題ない

| @tsubheading{} |
| @b{}           |
| @w{}           |
| @samp{}        |
| @i{}           |
| @footnote{}    |
| @emph{}        |
| @r{}           |

  - @var{}の内部を訳すと，文字化けする可能性がある．

* その他
  - 主語と述語を正しく対応付ける
  - 原則的に「能動態」で書く．受動態は主に，対象の客観的事実について使われる．
	 => 「この機能は，3つの要素で構成されます」
  - 曖昧な表現／冗長な表現を避ける．
  - 3語以上連続する名詞で新しい単語を作らないようにする．「〜の」などを使う．
	「Beamer class export」 => 「Beamerクラスのエクスポート」

  - 体言止めを避ける．
  - 二重否定を避ける．
  - 否定表現は肯定文に置き換える．
  - 意味のない語句を排除する
	「説明を行う」 => 「説明する」
  - 口語を避けて文語で書く
	「だけど」 => 「しかし」
