docs/style.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2018-10-27 Sat 07:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-mode 翻訳スタイルガイド</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takaaki ISHIKAWA" />
</head>
<body>
<div id="content">
<h1 class="title">Org-mode 翻訳スタイルガイド</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org20bc1b7">1. 文体</a></li>
<li><a href="#org4df4f4f">2. 英単語のカタカナ表記</a></li>
<li><a href="#org43ab749">3. カタカナ表記における「・」</a></li>
<li><a href="#orgb220b7e">4. 文頭意外の大文字</a></li>
<li><a href="#org936c4a9">5. 算用数字と漢数字</a></li>
<li><a href="#org6285ab5">6. 句読点</a></li>
<li><a href="#org3f597e5">7. 単数形と複数形</a></li>
<li><a href="#org858b20f">8. 英数字の前後</a></li>
<li><a href="#org0b560f4">9. 強調する場合</a></li>
<li><a href="#org25592ae">10. Texinfo コマンドについて</a></li>
<li><a href="#org7f86a8b">11. その他</a></li>
</ul>
</div>
</div>
<p>
#+READONLY<br />
</p>
<div id="outline-container-org20bc1b7" class="outline-2">
<h2 id="org20bc1b7"><span class="section-number-2">1</span> 文体</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>原則として，「です／ます調」に統一する．<br /></li>
</ul>

<p>
ただし，箇条書きの中やコマンドの説明など，場合によっては「である調」を<br />
用いても良い．<br />
</p>
</div>
</div>

<div id="outline-container-org4df4f4f" class="outline-2">
<h2 id="org4df4f4f"><span class="section-number-2">2</span> 英単語のカタカナ表記</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>原則として「長音」を使う<br /></li>
</ul>

<p>
ただし，慣用表現の場合は例外とする．<br />
</p>
</div>
</div>

<div id="outline-container-org43ab749" class="outline-2">
<h2 id="org43ab749"><span class="section-number-2">3</span> カタカナ表記における「・」</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>原則として「・」を入れない．<br /></li>
</ul>
<p>
オンライン・ショッピング =&gt; オンラインショッピング<br />
</p>

<p>
ただし，人名は例外とする．<br />
</p>
</div>
</div>

<div id="outline-container-orgb220b7e" class="outline-2">
<h2 id="orgb220b7e"><span class="section-number-2">4</span> 文頭意外の大文字</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>原則として原語をそのまま利用する．<br /></li>
</ul>

<p>
Emacs，Lisp，など．<br />
</p>
</div>
</div>

<div id="outline-container-org936c4a9" class="outline-2">
<h2 id="org936c4a9"><span class="section-number-2">5</span> 算用数字と漢数字</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>算用数字は，半角小文字で表記する．<br /></li>
<li>数を表す場合は，算用数字を用いる．（10人，70個）<br /></li>
<li>意味を表す場合は，漢数字を用いる．（一度の，二重の）<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org6285ab5" class="outline-2">
<h2 id="org6285ab5"><span class="section-number-2">6</span> 句読点</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>「､。」に統一する．<br /></li>
</ul>

<p>
PDFなどへの文書変換時に自動置換するため，厳守ではない．<br />
</p>
</div>
</div>

<div id="outline-container-org3f597e5" class="outline-2">
<h2 id="org3f597e5"><span class="section-number-2">7</span> 単数形と複数形</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>単数形と複数形でも訳が変わらず，カタカナ訳をそのまま用いる場合は最後の's'は訳に含めない<br /></li>
</ul>

<p>
@&lt;pre&gt;<br />
	（○）archive  =&gt; アーカイブ<br />
	（○）archives =&gt; アーカイブ<br />
	（×）archives =&gt; アーカイブス<br />
@&lt;/pre&gt;<br />
</p>
</div>
</div>

<div id="outline-container-org858b20f" class="outline-2">
<h2 id="org858b20f"><span class="section-number-2">8</span> 英数字の前後</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><p>
半角スペースを含めない．<br />
</p>

<p>
=&gt; PO から texi に変換する技術的な問題から，含めない．<br />
</p></li>
</ul>
<p>
（外観は，翻訳作業終了後にバッチ処理で修正可能）<br />
</p>

<ul class="org-ul">
<li>同様の理由から，翻訳文には半角スペースを入れないこと．<br /></li>
</ul>
<p>
	改行が必要な場合は，<br />
@&lt;pre&gt;<br />
	これは一行目です。\n<br />
	これは二行目です。<br />
@&lt;/pre&gt;<br />
	というように，改行コード（\n）を入れる．<br />
</p>
</div>
</div>

<div id="outline-container-org0b560f4" class="outline-2">
<h2 id="org0b560f4"><span class="section-number-2">9</span> 強調する場合</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>クォーテーション（「"」「'」）は用いず，「」でくくる．<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org25592ae" class="outline-2">
<h2 id="org25592ae"><span class="section-number-2">10</span> Texinfo コマンドについて</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>コマンドの書き写しミスに気を付ける．<br /></li>
<li>括弧の対応関係（閉じ忘れなど）に気を付ける．<br /></li>
<li>node は翻訳せずに，英文をそのまま書き写す．<br /></li>
<li>エスケープシーケンス（\, バックスラッシュ）の重複に気を付ける．<br /></li>
<li>@pxref{hoge} は，(@pxref{hoge}) というように中括弧に含まれているのがルール<br /></li>
<li>@xref{hoge} は，@xref{hoge}. のように半角ピリオドで終わるのがルール<br /></li>
<li>次のコマンドの中身は訳しても問題ない<br /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">@tsubheading{}</td>
</tr>

<tr>
<td class="org-left">@b{}</td>
</tr>

<tr>
<td class="org-left">@w{}</td>
</tr>

<tr>
<td class="org-left">@samp{}</td>
</tr>

<tr>
<td class="org-left">@i{}</td>
</tr>

<tr>
<td class="org-left">@footnote{}</td>
</tr>

<tr>
<td class="org-left">@emph{}</td>
</tr>

<tr>
<td class="org-left">@r{}</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>@var{}の内部を訳すと，文字化けする可能性がある．<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org7f86a8b" class="outline-2">
<h2 id="org7f86a8b"><span class="section-number-2">11</span> その他</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>主語と述語を正しく対応付ける<br /></li>
<li>原則的に「能動態」で書く．受動態は主に，対象の客観的事実について使われる．<br />
=&gt; 「この機能は，3つの要素で構成されます」<br /></li>
<li>曖昧な表現／冗長な表現を避ける．<br /></li>
<li>3語以上連続する名詞で新しい単語を作らないようにする．「〜の」などを使う．<br /></li>
</ul>
<p>
「Beamer class export」 =&gt; 「Beamerクラスのエクスポート」<br />
</p>

<ul class="org-ul">
<li>体言止めを避ける．<br /></li>
<li>二重否定を避ける．<br /></li>
<li>否定表現は肯定文に置き換える．<br /></li>
<li>意味のない語句を排除する<br /></li>
</ul>
<p>
「説明を行う」 =&gt; 「説明する」<br />
</p>
<ul class="org-ul">
<li>口語を避けて文語で書く<br /></li>
</ul>
<p>
「だけど」 =&gt; 「しかし」<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Takaaki ISHIKAWA</p>
<p class="date">Created: 2018-10-27 Sat 07:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
